#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
<details><summary>Show Plan</summary>
```

terraform
module.project-factory["new-luis"].module.gsuite_group.data.google_organization.org[0]: Reading...
module.project-factory["new-luis"].module.gsuite_group.data.google_organization.org[0]: Read complete after 1s [id=organizations/65202286851]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + folder_id           = "250869018475"
      + id                  = (known after apply)
      + name                = "new-luis"
      + number              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DISABLE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_project_iam_member.gsuite_group_role[0] will be created
  + resource "google_project_iam_member" "gsuite_group_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-new-luis@luismendeze.com"
      + project = (known after apply)
      + role    = "roles/viewer"
    }

  # module.project-factory["new-luis"].module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + disabled     = false
      + display_name = "new-luis Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_service_account_iam_member.service_account_grant_to_group[0] will be created
  + resource "google_service_account_iam_member" "service_account_grant_to_group" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "group:gcp-new-luis@luismendeze.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.random_string.random_project_id_suffix[0] will be created
  + resource "random_string" "random_project_id_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + output-value = {
      + new-luis = {
          + api_s_account                = (known after apply)
          + api_s_account_fmt            = (known after apply)
          + budget_name                  = ""
          + domain                       = "luismendeze.com"
          + enabled_api_identities       = {}
          + enabled_apis                 = []
          + group_email                  = "gcp-new-luis@luismendeze.com"
          + project_bucket_self_link     = []
          + project_bucket_url           = []
          + project_id                   = (known after apply)
          + project_name                 = "new-luis"
          + project_number               = (known after apply)
          + service_account_display_name = "new-luis Project Service Account"
          + service_account_email        = (known after apply)
          + service_account_id           = "project-service-account"
          + service_account_name         = (known after apply)
          + service_account_unique_id    = (known after apply)
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @luismendezescobar, Action: `pull_request`, Working Directory: ``, Workflow: `validate code`*